export const manualData = {
    Chapters: {
        "chapter_1": {
            title: "מבוא - מהוא פרוטוקול?",
            pages: {
                "page_1": {
                    "line_1": "פרוטוקול תקשורת הוא אוסף של חוקים. הוא קובע איך שולחים ומקבלים הודעות במערכות תקשורת.",
                    "line_2": ' אפשר לחשוב על זה כמו שיחת טלפון:<br>* מי שמתקשר אומר "הלו" </br>  * הצד השני עונה ',
                },
                "page_2": {
                    "line_1": '* רק אז מדברים<br> * ובסוף? נפרדים עם "להתראות"',
                    "line_2": "בלי הסדר הזה — אף אחד לא יבין מה קורה. גם בעולם הדיגיטלי, כל הודעה חייבת להישלח לפי פרוטוקול מסודר.",
                },
                "page_3": {
                    "line_1": "איך נראית הודעה? <br> כל הודעה מורכבת מכמה חלקים קבועים:",
                    "line_2": "* פתיחה <span style='color:var(--red)'> (header)</span> <br> מידע טכני: מי שלח, למי, באיזה פרוטוקול, ועוד.",
                    "line_3": "* מידע <span style='color:var(--red)'>(data)</span> <br> ההודעה עצמה — הקובץ, הטקסט או הנתונים."
                },
                "page_4": {
                    "line_1": "* סיומת <span style='color:var(--red)'>(Footer)</span> <br> סימן מוסכם לסיום. לפעמים כולל בדיקת תקינות <span style='color:var(--red)'>(Checksum)</span>.",
                    "line_2": "אם חסר חלק? ההודעה לא תעבור כמו שצריך."
                },
                "page_5": {
                    "line_1": "מה נלמד בהמשך?",
                    "line_2": "בכל פרק תלמד על פרוטוקול אחר.לכל אחד יש חוקים משלו - מה מותר, מה חובה, ואיפה אסור לטעות."
                }
            }
        },

        "chapter_2": {
            title: "FTP-File Transfer Protocol",
            pages: {
                "page_1": {
                    "line_1" : "* פרוטוקול תקשורת משכבת ה יישום, מבוסס TCP להעברת קבצים בין מחשבים בעלי מערכות הפעלה שאינן זהות בהכרח.",
                    "line_2" : "* לפרוטוקול ה-FTP יש זמן תגובה(Latency) ארוץ מאוד. הזמן שלוקח בין שליחת הבקשה למידע לבין התחלת קבלת המידע הוא ארוך מאוד ודורש תהליך כניסה (login) ארוך למדי."
                },

                "page_2": {
                    "line_1" : "* פרוטוקול זה משתמש בפורטים 20 ו- 21 של TCP מצד השרת.",
                    "line_2" : "* פרוטוקול 21 משמש ליצירת קשר ראשוני ופורט 20 משמש להעברת מידע. הצד היוזם משתמש בפורטים רנדומליים."
                }
            }
        }
    }
};